Repository: AnsaganK/enic
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Орталық туралы
ru: О центре

source: ЖОҒАРЫ БІЛІМ БЕРУДІ ДАМЫТУ ҰЛТТЫҚ ОРТАЛЫҒЫ
ru: НАЦИОНАЛЬНЫЙ ЦЕНТР РАЗВИТИЯ ВЫСШЕГО ОБРАЗОВАНИЯ

source: Басты
ru: Главная

source: Орталықтың тарихы
ru: История центра

source: ҚР ҒЖБМ "Жоғары білім беруді дамыту ұлттық орталығы" ШЖҚ РМК – Қазақстан Республикасы Ғылым және жоғары білім министрлігінің ведомстволық бағынышты ұйымы.
ru: РГП на ПХВ 'Национальный Центр развития высшего образования' МНВО РК – подведомственная организация Министерства науки и высшего образования Республики Казахстан.

source: Қазақстан 2010 жылы Болон Декларациясына қол қойып, Болон процесіне қатысушы елдер қатарында 47 орынға ие болды жәнеЕуропалық білім кеңістігінің толық құқықты мүшесі болып танылған бірінші Орта-азиялық мемлекет.
ru: Казахстан подписав, Болонскую Декларацию в 2010 году, стал 47-й страной-участницей Болонского процесса и первым центрально-азиатским государством, признанным полноправным членом Европейского образовательного пространства.

source: Әр қатысушы ел Болон процесінің міндетті, ұсыныстық және қосымша параметрлері бойынша өзіне міндеттемелер қабылдайды.
ru: Каждая страна-участница принимает на себя обязательства по исполнению обязательных, рекомендательных и факультативных параметров Болонского процесса.

source: Орталық 2012 жылдың 31 тамызында Қазақстан Республикасында ұлттық деңгейде Болон процесі параметрлерінің жүзеге асырылуын әдістемелік, ғылыми-әдістемелік және ақпараттық-талдамалық сүйемелдеу мақсатында құрылды.
ru: Центр создан 31 августа 2012 года в целях методологического, научно-методического и информационно-аналитического сопровождения реализации параметров Болонского процесса в Республике Казахстан на национальном уровне.

source: Негіздеме - Қазақстан Республикасы Президентінің 2010 жылғы7 желтоқсандағы №1118 «Қазақстан Республикасында білім беруді дамытудың 2011 - 2020 жылдарға арналған мемлекеттік бағдарламасын бекіту туралы» Жарлығы.
ru: Основание - Указ Президента Республики Казахстан от 7 декабря 2010 года №1118 «Об утверждении Государственной программы развития образования Республики Казахстан на 2011-2020 годы».

source: ҚЫЗМЕТІНІҢ НЕГІЗГІ ПРИНЦИПТЕРІ
ru: Основные принципы деятельности

source: Қазақстанның жоғары оқу орындарымен өзара әрекеттесу және ашықтық
ru: Открытость и взаимодействие с высшими учебными заведениями Казахстана

source: Барлық мүдделі тараптардың ақпаратқа қол жетімділігі
ru: Доступность к информации всех заинтересованных сторон

source: Басқару мен шешімдер қабылдаудағы алқалылық
ru: Коллегиальность в управлении и принятии решений.

source: Стратегиясы және міндеті
ru: Стратегия и миссия

source: Құрылымы
ru: Структура

source: Орталықтың Меморандумдары
ru: Меморандумы центра

source: Қоғамдық өмір
ru: Общественная жизнь

source: Пресс - релиз, 2023 жылғы 2 мамырда
ru: Пресс-релиз, 2 мая 2023 г.

source: Бүгін, 2023 жылғы 2 мамырда, Жоғары білім беруді дамыту ұлттық орталығының директоры А.А. Мухатаев пен Еңбек ресурстарын дамыту орталығының президенті Д.Р. Аргандыков, Қазақстан Республикасы Ғылым және жоғары білім министрлігінің «Жоғары білім беруді дамыту ұлттық орталығы» ШЖҚ РМК мен Қазақстан Республикасы Еңбек және халықты әлеуметтік қорғау министрлігінің «Еңбек ресурстарын дамыту орталығы» АҚ арасында ынтымақтастық және өзара іс-қимыл туралы Меморандумға қол қойды.
ru: Сегодня, 2 мая 2023 года, директор Национального центра развития высшего образования А.А. Мухатаев и президент Центра развития человеческих ресурсов Д.Р. Аргандыков подписал Меморандум о сотрудничестве и взаимодействии между РГП Министерства науки и высшего образования Республики Казахстан «Национальный центр развития высшего образования» и АО «Центр развития трудовых ресурсов» Министерства труда и социальной защиты населения Республики Казахстан.

source: Ынтымақтастық білім беру бағдарламаларын әзірлеу кезінде кәсіби стандарттарды пайдалануда және Ұлттық біліктілік жүйесін іске асыруда тараптардың тиімді өзара іс-қимылына бағытталған.
ru: Сотрудничество направлено на эффективное взаимодействие сторон по использованию профессиональных стандартов при разработке образовательных программ и внедрении Национальной системы квалификаций.

source: Екі орталықтың бірлескен қызметі Ұлттық біліктілік жүйесі мен білікті кадрларды даярлау жүйесін әдіснамалық қолдауды қалыптастыру үшін негіз болады.
ru: Совместная деятельность двух центров послужит основой формирования Национальной системы квалификаций и методического обеспечения системы подготовки квалифицированных кадров.

source: Бірге – таза Қазақстан
ru: Вместе – за чистый Казахстан

source: Біздің өміріміздегі жасыл желектердің рөлін бағалау мүмкін емес. Олар адам өміріне әсер етіп қана қоймайды, сонымен бірге экологиялық қауіпсіздіктің кепілі болып табылады. «Бірге - таза Қазақстан!» экологиялық акциясы аясында 2021 жылы 1 мамырда Болон процесі және академиялық ұтқырлық орталығы жалпықалалық сенбілікке қатысты, сенбіліктің форматы - ағаш отырғызу. Бұл ағаш отырғызу науқаны көгалдандыру мен қоршаған ортаны қорғаудың тағы бір жарқын мысалы болды.
ru: Роль зелени в нашей жизни невозможно переоценить. Они не только влияют на жизнь человека, но и служат гарантией экологической безопасности. «Вместе — чистый Казахстан!» В рамках экологической акции 1 мая 2021 года Болонский процесс и Центр академической мобильности приняли участие в общегородском саббатикале, форматом которого стала посадка деревьев. Эта кампания по посадке деревьев стала еще одним ярким примером озеленения и защиты окружающей среды.

source: Қазақстанның жоғары және жоғары оқу орнынан кейінгі білім беру жүйесіне Болон процесі параметрлерін ендіруді ғылыми-әдістемелік және ақпараттық-талдамалық қолдау.
ru: Научно-методическое и информационно-аналитическое обеспечение внедрения параметров Болонского процесса в систему высшего и послевузовского образования Казахстана.

source: Жаңалыктар
ru: Новости

source: Сұрақ-жауап
ru: Вопрос-ответ

source: Дипломды тану қалай өтеді?
ru: Как признается диплом?

source: Дипломды тану үшін ENIC-Kazakhstan сайтындағы өтінім формасын толтырып, қажетті құжаттарды жүктеу қажет.
ru: Для признания вашего диплома вам необходимо заполнить заявку на сайте ENIC-Kazakhstan и загрузить необходимые документы.

source: Қандай құжаттар қажет?
ru: Какие документы необходимы?

source: Жеке куәлік, диплом, қосымша (транскрипт), төлқұжаттың көшірмесі және қажет болған жағдайда аудармалар талап етіледі.
ru: Требуются удостоверение личности, диплом, копия паспорта и переводы при необходимости.

source: Аккредитация дегеніміз не?
ru: Что такое аккредитация?

source: Аккредитация — бұл оқу ордасының білім беру қызметінің сапасын тәуелсіз бағалау рәсімі.
ru: Аккредитация — процедура независимой оценки качества образовательных услуг, предоставляемых образовательным учреждением.

source: Болон үдерісі не береді?
ru: Что дает Болонский процесс?

source: Болон үдерісі — Еуропалық жоғары білім кеңістігінде білім сапасын арттыру мен студенттердің мобильділігін қамтамасыз етуге бағытталған бастама.
ru: Болонский процесс — это инициатива, направленная на повышение качества образования и обеспечение мобильности студентов в Европейском пространстве высшего образования.

source: Жауапты қайдан алуға болады?
ru: Где я могу получить ответ?

source: Сіз бізге сайттағы байланыс формасы арқылы немесе көрсетілген байланыс нөмірлері арқылы хабарласа аласыз.
ru: Вы можете связаться с нами через контактную форму на сайте или по указанным контактным номерам.

source: Байланыс
ru: Контакты

source: Мекен-жай
ru: Адрес

source: Қазақстан Республикасы, Астана қ., Сығанақ көшесі, 70, № 202 кеңсе
ru: Республика Казахстан, г. Астана, ул. Сыганак, 70, офис № 202

source: Аты
ru: Имя

source: Тақырып
ru: Тема

source: Хабарлама
ru: Сообщение

source: Күтіңіз
ru: Ждите

source: Хабарлама жіберілді
ru: Заявка отправлена

source: Жіберу
ru: Отправить

source: Басты бет
ru: Главная страница

source: Білімге жол<br> болашаққа бастар бағыт
ru: Путь к знаниям <br>направление на будущее

source: Жоғары білімді дамытудың заманауи платформасы
ru: Современная платформа для развития высшего образования

source: Өтінім жіберу
ru: Отправить заявку

source: Жоғары білім туралы өзекті ақпарат бір жерде
ru: Актуальная информация о высшем образовании в одном месте

source: ENIC.KZ — құжаттарды тану, аккредитация және Болон үдерісі бойынша ресми портал.
ru: ENIC.KZ — официальный портал по признанию документов, аккредитации и Болонскому процессу

source: ЖОО аккредитациясын тексеру
ru: Проверка аккредитации университета

source: Дипломды тануға онлайн өтінім беру
ru: Подать заявку онлайн на признание диплома

source: Болон үдерісімен танысу
ru: Введение в Болонский процесс

source: Тағы
ru: Далее

source: ЖОО
ru: ВУЗ

source: Студент косылды
ru: Добавилось студентов

source: Күндізгі форматта
ru: Очная форма

source: ЖОО тізімі
ru: Список ВУЗов

source: Болон процесі
ru: Болонский процесс

source: Дипломды тану
ru: Признание диплома

source: Сарапшылар
ru: Эксперты

source: Қызметтер
ru: Сервисы

source: Өтініш күйін тексеру
ru: Проверить статус заявки

source: Оқу бағдарламалары
ru: Учебные программы

source: Пікір қалдыру
ru: Оставить отзыв

source: Жаңалықтар
ru: Новости

source: Соңғы жаңалыктар
ru: Актуальные новости

source: Басшылық құрам
ru: Начальствующий состав

source: ДИРЕКТОР ОРЫНБАСАРЫ
ru: Заместитель директора

source: ДИРЕКТОР КЕҢЕСШІСІ
ru: Советник директора

source: Жеке кабинет
ru: Личный кабинет

source: Жөні
ru: Фамилия

source: Өзгерту
ru: Изменить

source: Шығу
ru: Выйти

source: Пайдалы сілтемелер
ru: Полезные ссылки

source: Сатып алулар
ru: Закупки

source: Жұмыс орындары
ru: Вакансии

source: Құпиялылық саясаты
ru: Политика конфиденциальности

source: Кіру
ru: Вход

source: Сіз жүйеге кірдіңіз
ru: Вы авторизованиы

source: Басты бетке
ru: На главную

source: Құпиясөз
ru: Пароль

source: Тіркелмегенсіз бе
ru: Не зарегистрированы

source: Тіркелу
ru: Регистрация

source: Тіркелгенсіз бе
ru: Зарегистрированы
