from django.http import JsonResponse
from django.shortcuts import render


def university_list(request):
    return render(request, 'app/university/list.html')


def university_map(request):
    return render(request, 'app/university/map.html')


def region_universities(request, region_id):
    regions = {
        "KZ10": "Абайская область",
        "KZ11": "Акмолинская область",
        "KZ15": "Актюбинская область",
        "KZ19": "Алматинская область",
        "KZ23": "Атырауская область",
        "KZ27": "Западно-Казахстанская область",
        "KZ31": "Жамбылская область",
        "KZ33": "Жетысуская область",
        "KZ35": "Карагандинская область",
        "KZ39": "Костанайская область",
        "KZ43": "Кызылординская область",
        "KZ47": "Мангистауская область",
        "KZ55": "Павлодарская область",
        "KZ59": "Северо-Казахстанская область",
        "KZ61": "Туркестанская область",
        "KZ62": "Улытауская область",
        "KZ63": "Восточно-Казахстанская область",
        "KZ71": "город Астана",
        "KZ75": "город Алматы",
        "KZ79": "город Шымкент",
    }
    universities = {
        "KZ71": [
            {
                "name": "Евразийский национальный университет им. Л.Н.Гумилева",
                "site": "enu.kz"
            },
            {
                "name": "Казахская национальная академия хореографии",
                "site": "balletacademy.edu.kz"
            },
            {
                "name": "Казахский национальный университет искусств",
                "site": "kaznui.edu.kz"
            },
            {
                "name": "Казахский агротехнический университет им. С. Сейфуллина",
                "site": "kazatu.edu.kz"
            },
            {
                "name": "Медицинский университет Астана",
                "site": "amu.edu.kz"
            },
            {
                "name": "Казахский университет технологии и бизнеса",
                "site": "www.kaztbu.edu.kz"
            },
            {
                "name": "Университет КАЗГЮУ им. М.С.Нарикбаева",
                "site": "mnu.kz"
            },
            {
                "name": "Astana IT University",
                "site": "astanait.edu.kz"
            },
            {
                "name": "Академия физической культуры и массового спорта",
                "site": "apems.edu.kz"
            },
            {
                "name": "Евразийский гуманитарный институт",
                "site": "egi.edu.kz"
            },
            {
                "name": "Университет Есиль",
                "site": "esil.edu.kz"
            },
            {
                "name": "Международный университет Астана",
                "site": "aiu.kz"
            }
        ],
        "KZ19": [
            {
                "name": "Казахская национальная академия искусств им. Т. Жургенова",
                "site": "talapker.kaznai.kz"
            },
            {
                "name": "Казахская национальная консерватория им. Курмангазы",
                "site": "conservatoire.edu.kz"
            },
            {
                "name": "Академия гражданской авиации",
                "site": "caa.edu.kz"
            },
            {
                "name": "Академия логистики и транспорта/бывш. КазАТК",
                "site": "alt.edu.kz"
            },
            {
                "name": "Казахский университет международных отношений и мировых языков им. Абылай хана",
                "site": "www.ablaikhan.kz"
            },
            {
                "name": "Университет КИМЭП",
                "site": "www.kimep.kz"
            },
            {
                "name": "Академия Кайнар",
                "site": "q-university.edu.kz"
            },
            {
                "name": "Евразийская юридическая академия им. Д.А.Кунаева",
                "site": "vuzkunaeva.kz"
            },
            {
                "name": "Евразийский технологический университет",
                "site": "etu.edu.kz"
            },
            {
                "name": "Египетский университет исламской культуры Нур-Мубарак",
                "site": "www.nmu.edu.kz"
            },
            {
                "name": "Международный транспортно-гуманитарный университет",
                "site": "mtgu.edu.kz"
            },
            {
                "name": "Международный инженерно-технологический университет",
                "site": "metu.edu.kz"
            },
            {
                "name": "Казахстанский медицинский университет \"ВШОЗ\"",
                "site": "ksph.edu.kz"
            },
            {
                "name": "Казахстанско-Немецкий университет",
                "site": "dku.kz/ru"
            },
            {
                "name": "Казахстанско-Российский медицинский университет",
                "site": "new.krmu.edu.kz"
            },
            {
                "name": "Каспийский общественный университет",
                "site": "https://cu.edu.kz/"
            },
            {
                "name": "Университет \"Туран-Астана\"",
                "site": "tau-edu.kz"
            },
            {
                "name": "Жетысуский университет им. И.Жансугурова",
                "site": "zhetysu.edu.kz"
            }
        ],
        "KZ75": [
            {
                "name": "Казахский национальный аграрный исследовательский университет",
                "site": "kaznaru.edu.kz"
            },
            {
                "name": "Казахский национальный женский педагогический университет",
                "site": "qyzpu.edu.kz"
            },
            {
                "name": "Казахский национальный исследовательский технический университет им. К.И. Сатпаева",
                "site": "satbayev.university"
            },
            {
                "name": "Казахский национальный медицинский университет им. С.Д. Асфендиярова",
                "site": "kaznmu.edu.kz"
            },
            {
                "name": "Казахский национальный педагогический университет им. Абая",
                "site": "kaznpu.kz"
            },
            {
                "name": "Казахский национальный университет им. Аль-Фараби",
                "site": "farabi.university"
            },
            {
                "name": "Алматинский университет энергетики и связи им. Г. Даукеева",
                "site": "energo.university"
            },
            {
                "name": "Алматинский технологический университет",
                "site": "atu.edu.kz"
            },
            {
                "name": "Казахская академия спорта и туризма",
                "site": "kazast.edu.kz"
            },
            {
                "name": "Казахстанско-Британский технический университет",
                "site": "kbtu.edu.kz"
            },
            {
                "name": "Международная образовательная корпорация",
                "site": "mok.edu.kz"
            },
            {
                "name": "Международный университет информационных технологий",
                "site": "iitu.edu.kz"
            },
            {
                "name": "Университет Нархоз",
                "site": "narxoz.edu.kz"
            },
            {
                "name": "Алматинский гуманитарно-экономический университет",
                "site": "aesa.kz"
            },
            {
                "name": "Алматы менеджмент университет",
                "site": "almau.edu.kz"
            },
            {
                "name": "Казахский автомобильно-дорожный институт им. Б.Гончарова",
                "site": "kazadi.edu.kz"
            },
            {
                "name": "Университет им. С. Демиреля",
                "site": "sdu.edu.kz"
            },
            {
                "name": "Университет международного бизнеса",
                "site": "uib.edu.kz"
            }
        ],
        "KZ15": [
            {
                "name": "Актюбинский региоанльный университет им. К.Жубанова",
                "site": "zhubanov.edu.kz"
            },
            {
                "name": "Западно-Казахстанский медицинский университет им. М. Оспанова",
                "site": "zkmu.edu.kz"
            },
            {
                "name": "Баишев Университет",
                "site": "site.bu.edu.kz"
            },
            {
                "name": "Казахско-Русский Международный университет",
                "site": "kriu.edu.kz"
            }
        ],
        "KZ39": [
            {
                "name": "Аркалыкский педагогический институт им. И.Алтынсарина",
                "site": "api.edu.kz"
            },
            {
                "name": "Костанайский региональный университет им. А. Байтурсынова",
                "site": "ksu.edu.kz"
            },
            {
                "name": "Рудненский индустриальный институт",
                "site": "www.rii.edu.kz"
            },
            {
                "name": "Костанайский инженерно-экономический университет им. М. Дулатова",
                "site": "kineu.edu.kz"
            },
            {
                "name": "Костанайский социально-технический университет им. академика З. Алдамжар",
                "site": "kosstu.edu.kz"
            }
        ],
        "KZ23": [
            {
                "name": "Атырауский университет им. Х.Досмухамедова",
                "site": "asu.edu.kz"
            },
            {
                "name": "Атырауский университет нефти и газа им. С.Утебаева",
                "site": "aogu.edu.kz"
            },
            {
                "name": "Атырауский инженерно-гуманитарный институт",
                "site": "?"
            }
        ],
        "KZ63": [
            {
                "name": "Восточно-Казахстанский университет им. С. Аманжолова",
                "site": "vku.edu.kz"
            },
            {
                "name": "Восточно-Казахстанский технический университет им. Д.Серикбаева",
                "site": "www.ektu.kz"
            },
            {
                "name": "Казахстанско-Американский свободный университет",
                "site": "kafu.edu.kz"
            }
        ],
        "KZ33": [
            {
                "name": "Университет «Сырдария»",
                "site": "?"
            }
        ],
        "KZ27": [
            {
                "name": "Западно-Казахстанский аграрно-технический университет им. Жангир хана",
                "site": "wkau.edu.kz"
            },
            {
                "name": "Западно-Казахстанский университет им. М.Утемисова",
                "site": "wku.edu.kz"
            },
            {
                "name": "Западно-Казахстанский инновационно-технологический университет",
                "site": "wkitu.kz"
            },
            {
                "name": "Казахский университет инновационных и телекоммуникационных систем",
                "site": "www.kazuits.edu.kz/"
            }
        ],
        "KZ35": [
            {
                "name": "Карагандинский индустриальный университет",
                "site": "kgiu.kz"
            },
            {
                "name": "Карагандинский технический университет",
                "site": "www.kstu.kz"
            },
            {
                "name": "Карагандинский университет им. академика Е.А.Букетова",
                "site": "buketov.edu.kz"
            },
            {
                "name": "Медицинский университет Караганды",
                "site": "qmu.edu.kz"
            },
            {
                "name": "Жезказганский университет им. О.А.Байконурова",
                "site": "zhezu.edu.kz"
            },
            {
                "name": "Академия \"Bolashaq\"",
                "site": "bolashaq.edu.kz"
            },
            {
                "name": "Карагандинский экономический университет Казпотребсоюза",
                "site": "www.keu.kz"
            },
            {
                "name": "Центрально-Казахстанская академия",
                "site": "c-k-a.edu.kz"
            }
        ],
        "KZ11": [
            {
                "name": "Кокшетауский университет им. Ш.Уалиханова",
                "site": "shokan.edu.kz"
            },
            {
                "name": "Гуманитарно-техническая академия",
                "site": "?"
            },
            {
                "name": "Кокшетауский университет им. А. Мырзахметова",
                "site": "kuam.edu.kz/ru"
            }
        ],
        "KZ43": [
            {
                "name": "Кызылординский университет им. Коркыт Ата",
                "site": "korkyt.edu.kz"
            },
            {
                "name": "Гуманитарно-технический институт Акмешит",
                "site": "?"
            },
            {
                "name": "Кызылординский университет \"Болашак\"",
                "site": "bolashak-edu.kz"
            }
        ],
        "KZ55": [
            {
                "name": "Павлодарский педагогический университет",
                "site": "ppu.edu.kz"
            },
            {
                "name": "Торайгыров университет",
                "site": "tou.edu.kz"
            },
            {
                "name": "Екибастузский инженерно-технический институт им. академика К.Сатпаева",
                "site": "eiti.edu.kz"
            },
            {
                "name": "Инновационный Евразийский университет",
                "site": "ineu.edu.kz"
            }
        ],
        "KZ59": [
            {
                "name": "Северо-Казахстанский университет им. М.Козыбаева",
                "site": "ku.edu.kz"
            }
        ],
        "KZ10": [
            {
                "name": "Университет им. Шакарима г. Семей",
                "site": "shakarim.edu.kz"
            },
            {
                "name": "Медицинский университет г. Семей",
                "site": "smu.edu.kz"
            },
            {
                "name": "Алихан Бокейхан университет",
                "site": "abu.edu.kz"
            }
        ],
        "KZ31": [
            {
                "name": "Таразский региональный университет им. М.Х.Дулати",
                "site": "dulaty.kz"
            },
            {
                "name": "Международный Таразский инновационный университет",
                "site": "?"
            }
        ],
        "KZ79": [
            {
                "name": "Южно-Казахстанский университет им. М.Ауэзова",
                "site": "auezov.edu.kz"
            },
            {
                "name": "Южно-Казахстанская медицинская академия",
                "site": "skma.edu.kz"
            },
            {
                "name": "Южно-Казахстанский государственный педагогический университет",
                "site": "okmpu.edu.kz"
            },
            {
                "name": "Университет дружбы народов им. академика А.Куатбекова",
                "site": "udn.edu.kz"
            },
            {
                "name": "Университет \"Мирас\"",
                "site": "miras.edu.kz"
            },
            {
                "name": "Центрально-Азиатский инновационный университет",
                "site": "caiu.edu.kz"
            },
            {
                "name": "Шымкентский университет",
                "site": "univershu.edu.kz/kz"
            }
        ],
        "KZ61": [
            {
                "name": "Международный университет туризма и гостеприимства",
                "site": "iuth.edu.kz"
            },
            {
                "name": "Международный казахско-турецкий университет им. Х.А.Ясави",
                "site": "ayu.edu.kz"
            }
        ],
        "KZ62": [],
        "KZ47": [],
    }
    return JsonResponse(
        {
            'region': regions.get(region_id),
            'universities': universities.get(region_id),
        }
    )
